Tekla.Structures.Catalogs.ProfileItem.ProfileItemSubTypeEnum
Defines the different profile item subtypes.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemSubTypeEnum.PROFILE_UNKNOWN_SUBTYPE
The unknown subtype profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemSubTypeEnum.PROFILE_I_HOT_ROLLED
The hot rolled I profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemSubTypeEnum.PROFILE_I_WELDED_SYMMETRICAL
The welded symmetrical I profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemSubTypeEnum.PROFILE_I_WELDED_UNSYMMETRICAL
The welded unsymmetrical I profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemSubTypeEnum.PROFILE_I_WELDED_SYMMETRICAL2
The welded symmetrical, altering height, I profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemSubTypeEnum.PROFILE_I_WELDED_UNSYMMETRICAL2
The welded unsymmetrical, altering height, I profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemSubTypeEnum.PROFILE_L_HOT_ROLLED
The hot rolled L profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemSubTypeEnum.PROFILE_L_COLD_ROLLED
The cold rolled L profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemSubTypeEnum.PROFILE_Z_COLD_ROLLED
The cold rolled Z profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemSubTypeEnum.PROFILE_U_HOT_ROLLED
The hot rolled U profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemSubTypeEnum.PROFILE_U_COLD_ROLLED
The cold rolled U profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemSubTypeEnum.PROFILE_PL_DEFAULT
The default plate profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemSubTypeEnum.PROFILE_D_CIRCULAR
The default circular section profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemSubTypeEnum.PROFILE_D_ELLIPTICAL
The elliptical circular section profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemSubTypeEnum.PROFILE_PD_CIRCULAR
The default circular hollow section profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemSubTypeEnum.PROFILE_PD_ELLIPTICAL
The elliptical circular hollow section profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemSubTypeEnum.PROFILE_PD_CIRCULAR_TAPERED
The tapered circular hollow section profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemSubTypeEnum.PROFILE_P_SQUARE
The square hollow section profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemSubTypeEnum.PROFILE_P_RECTANGULAR
The rectangular hollow section profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemSubTypeEnum.PROFILE_P_ALTERING_HEIGHT
The altering height hollow section profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemSubTypeEnum.PROFILE_C_HOT_ROLLED
The hot rolled C profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemSubTypeEnum.PROFILE_C_COLD_ROLLED
The cold rolled C profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemSubTypeEnum.PROFILE_T_HOT_ROLLED
The hot rolled T profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemSubTypeEnum.PROFILE_T_PARAMETRIC
The parametric T profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemSubTypeEnum.PROFILE_HK_SYMMETRICAL
The symmetrical welded box profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemSubTypeEnum.PROFILE_HK_UNSYMMETRICAL
The unsymmetrical welded box profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemSubTypeEnum.PROFILE_HQ_CENTERED
The centered HQ profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemSubTypeEnum.PROFILE_HQ_NOT_CENTERED
The not centered HQ profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemSubTypeEnum.PROFILE_ZZ_SYMMETRICAL
The symmetrical ZZ profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemSubTypeEnum.PROFILE_ZZ_NOT_SYMMETRICAL
The unsymmetrical ZZ profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemSubTypeEnum.PROFILE_CC_SYMMETRICAL
The symmetrical CC profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemSubTypeEnum.PROFILE_CC_NOT_SYMMETRICAL
The unsymmetrical CC profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemSubTypeEnum.PROFILE_CW_SYMMETRICAL
The symmetrical CW profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemSubTypeEnum.PROFILE_CW_UNSYMMETRICAL
The unsymmetrical CW profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemSubTypeEnum.PROFILE_CU_SYMMETRICAL
The symmetrical CU profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemSubTypeEnum.PROFILE_CU_NOT_SYMMETRICAL
The unsymmetrical CU profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemSubTypeEnum.PROFILE_EB_SYMMETRICAL
The symmetrical EB profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemSubTypeEnum.PROFILE_EB_NOT_SYMMETRICAL
The unsymmetrical EB profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemSubTypeEnum.PROFILE_BF_DEFAULT
The default BF profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemSubTypeEnum.PROFILE_SPD_CIRCULAR
The circular SPD profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemSubTypeEnum.PROFILE_SPD_ELLIPTICAL
The elliptical SPD profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemSubTypeEnum.PROFILE_SPD_CIRCULAR_TAPERED
The tapered circular SPD profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemSubTypeEnum.PROFILE_EC_SYMMETRICAL
The symmetrical EC profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemSubTypeEnum.PROFILE_EC_NOT_SYMMETRICAL
The unsymmetrical EC profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemSubTypeEnum.PROFILE_ED_DEFAULT
The default ED profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemSubTypeEnum.PROFILE_EE_DEFAULT
The default EE profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemSubTypeEnum.PROFILE_EF_DEFAULT
The default EF profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemSubTypeEnum.PROFILE_EZ_DEFAULT
The default EZ profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemSubTypeEnum.PROFILE_EW_DEFAULT
The default EW profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemSubTypeEnum.PROFILE_RCDL_SYMMETRICAL
The symmetrical RCDL profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemSubTypeEnum.PROFILE_RCDL_UNSYMMETRICAL
The unsymmetrical RCDL profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemSubTypeEnum.PROFILE_RCXX_DEFAULT
The RCXX default profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemSubTypeEnum.PROFILE_RCL_DEFAULT
The RCL default profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemSubTypeEnum.PROFILE_RCDX_SYMMETRICAL
The symmetrical RCDX profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemSubTypeEnum.PROFILE_RCDX_UNSYMMETRICAL
The unsymmetrical RCDX profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemSubTypeEnum.PROFILE_RCDX_UNSYMMETRICAL2
The unsymmetrical altered height RCDX profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemSubTypeEnum.PROFILE_RCX_DEFAULT
The RCX default profile.